export const cityMappings = {
  "洛杉磯": "LA",
  "芝加哥": "chicago",
  "科羅拉多": "colorado",
  "拉斯維加斯": "las vegas",
  "邁阿密": "Miami",
  "匹茲堡": "pittsburgh",
  "聖荷西": "san jose",
  "西雅圖": "seattle",
  "休士頓": "休士頓",
  "哥倫布": "哥倫布",
  "紐約": "紐約",
  "達拉斯": "達拉斯",
  "奧蘭多": "奧蘭多",
  "舊金山": "san francisco",
  "猶他": "猶他",
  "克里夫蘭": "克里夫蘭",
  "鹽湖城": "鹽湖城",
  "佛羅里達": "佛羅里達",
  "費城": "費城",
  "華盛頓": "Washington",
  "多倫多": "多倫多",
  "尼加拉瓜瀑布": "niagarafalls",
  "夏威夷": "夏威夷",
  "底特律": "底特律",
  "威斯康星": "wisconsin",
  "密歇根": "密歇根",
  "辛辛那提": "辛辛那提",
  "台北": "台北",  // Added "台北"
  "棕櫚泉": "palm spring",  // Added "palm spring"
  "嘉義": "嘉義", 
  "嘉義梅山": "嘉義梅山",
  "南投": "南投",
  "爾灣": "irvine", // Add your desired mapping for 爾灣
  "Solvang": "solvang", // Add your desired mapping for Solvang
  "聖塔芭芭拉": "santa barbara", // Add your desired mapping for 聖塔芭芭拉
  "Salinas": "salinas", // Add your desired mapping for Salinas
  "大霧山國家公園": "大霧山國家公園",
  "錫安國家公園": "錫安國家公園",
  "黃石國家公園": "黃石國家公園",
  "洛磯山國家公園": "洛磯山國家公園",
  "大堤頓國家公園": "大堤頓國家公園",
  "優勝美地國家公園": "優勝美地國家公園",
  "冰川國家公園": "冰川國家公園",
  "約書亞樹國家公園": "約書亞樹國家公園",
  "奧林匹克國家公園": "奧林匹克國家公園",
  "布萊斯峽谷國家公園": "布萊斯峽谷國家公園",
  "瑞尼爾山國家公園": "瑞尼爾山國家公園",
  "仙納度國家公園": "仙納度國家公園",
  "夏威夷火山國家公園": "夏威夷火山國家公園",
  "紅杉國家公園": "紅杉國家公園",
  "哈萊阿卡拉國家公園": "哈萊阿卡拉國家公園",
  "白沙國家公園": "白沙國家公園",
  "火山口湖國家公園": "火山口湖國家公園",
  "仙人掌國家公園": "仙人掌國家公園",
  "大沙丘國家公園": "大沙丘國家公園",
  "羚羊谷": "羚羊谷"
};


export const city_coordinate = {
  "洛杉磯": [34.0522, -118.2437],
  "芝加哥": [41.8781, -87.6298],
  "科羅拉多": [39.7392, -104.9903],
  "拉斯維加斯": [36.1699, -115.1398],
  "邁阿密": [25.7617, -80.1918],
  "匹茲堡": [40.4406, -79.9959],
  "聖荷西": [37.3382, -121.8863],
  "西雅圖": [47.6062, -122.3321],
  "休士頓": [29.7604, -95.3698],
  "哥倫布": [39.9612, -82.9988],
  "紐約": [40.7128, -74.0060],
  "達拉斯": [32.7767, -96.7970],
  "奧蘭多": [28.5383, -81.3792],
  "舊金山": [37.7749, -122.4194],
  "猶他": [40.7608, -111.8910],
  "克里夫蘭": [41.4993, -81.6944],
  "鹽湖城": [40.7608, -111.8910],
  "佛羅里達": [27.9944, -81.7603],
  "費城": [39.9526, -75.1652],
  "華盛頓": [38.8951, -77.0364],
  "多倫多": [43.6532, -79.3832],
  "尼加拉瓜瀑布": [43.0962, -79.0377],
  "夏威夷": [20.7961, -156.3319],
  "底特律": [42.3314, -83.0458],
  "威斯康星": [43.7844, -88.7879],
  "密歇根": [44.3148, -85.6024],
  "辛辛那提": [39.1031, -84.5120],
  "台北": [25.0330, 121.5654],  // Added coordinates for "台北"
  "棕櫚泉": [33.8303, -116.5453],  // Added coordinates for "palm spring"
  "嘉義": [23.4791, 120.4476], // Coordinates for 嘉義
  "嘉義梅山": [23.5748, 120.5554], // Coordinates for 嘉義
  "南投": [23.8388, 120.9686],  // Coordinates for 南投
  "爾灣": [33.6846, -117.8265], // Coordinates for 爾灣 (Irvine)
  "Solvang": [34.5958, -120.1370], // Coordinates for Solvang
  "聖塔芭芭拉": [34.4208, -119.6982], // Coordinates for 聖塔芭芭拉 (Santa Barbara)
  "Salinas": [36.6777, -121.6555], // Coordinates for Salinas
  '大霧山國家公園': [35.63496, -83.5434],
  '錫安國家公園': [37.3115, -113.0268],
  '黃石國家公園': [44.5023, -110.6111],
  '洛磯山國家公園': [40.3542, -105.6813],
  '大堤頓國家公園': [43.8087, -110.6734],
  '優勝美地國家公園': [37.8881, -119.5290],
  '冰川國家公園': [48.7770, -113.7803],
  '約書亞樹國家公園': [33.8992, -115.8868],
  '奧林匹克國家公園': [47.8189, -123.6125],
  '布萊斯峽谷國家公園': [37.5994, -112.1798],
  '瑞尼爾山國家公園': [46.8876, -121.7251],
  '仙納度國家公園': [38.4899, -78.4560],
  '夏威夷火山國家公園': [19.5183, -155.4669],
  '紅杉國家公園': [36.5050, -118.5554],
  '哈萊阿卡拉國家公園': [20.7272, -156.1532],
  '白沙國家公園': [32.8027, -106.3366],
  '火山口湖國家公園': [42.9426, -122.1300],
  '仙人掌國家公園': [32.3062, -111.1656],
  '大沙丘國家公園': [37.8008, -105.5940],
  '羚羊谷': [37.6527, -111.5084]
};

