export default [
  {
    name: '美國西部',
    id: 1000,
    children: [
      { name: '洛杉磯', id: 1 },
      { name: '聖荷西', id: 2 },
      { name: '拉斯維加斯', id: 3 },
      { name: '舊金山', id: 4 },
      { name: '西雅圖', id: 5 },
      { name: '猶他', id: 6 },
      { name: '鹽湖城', id: 7 },
      { name: '棕櫚泉', id: 8 },
      { name: '爾灣', id: 9 },
      { name: 'Solvang', id: 10 },
      { name: '聖塔芭芭拉', id: 11 },
      { name: 'Salinas', id: 12 }
    ]
  },
  {
    name: '美國東部',
    id: 1001,
    children: [
      { name: '匹茲堡', id: 9 },
      { name: '紐約', id: 10 },
      { name: '費城', id: 11 },
      { name: '華盛頓', id: 12 },
      { name: '佛羅里達', id: 13 },
      { name: '邁阿密', id: 14 },
      { name: '哥倫布', id: 15 },
      { name: '奧蘭多', id: 16 },
      { name: '克里夫蘭', id: 17 },
      { name: '底特律', id: 18 },
    ]
  },
  {
    name: '美國中部',
    id: 1002,
    children: [
      { name: '芝加哥', id: 19 },
      { name: '科羅拉多', id: 20},
      { name: '密歇根', id: 31},
      { name: '休士頓', id: 21 },
      { name: '達拉斯', id: 22 },
      { name: '辛辛那提', id: 23 }
    ]
  },
  {
    name: '加拿大',
    id: 1003,
    children: [
      { name: '多倫多', id: 24 },
      { name: '尼加拉瓜瀑布', id: 25 }
    ]
  },
  {
    name: '太平洋地區',
    id: 1004,
    children: [
      { name: '夏威夷', id: 26 }
    ]
  },
  {
    name: '國家公園',
    id: 1004,
    children: [
      { "name": "大霧山國家公園", "id": 1005 },
      { "name": "錫安國家公園", "id": 1006 },
      { "name": "黃石國家公園", "id": 1007 },
      { "name": "洛磯山國家公園", "id": 1008 },
      { "name": "大堤頓國家公園", "id": 1009 },
      { "name": "優勝美地國家公園", "id": 1010 },
      { "name": "冰川國家公園", "id": 1011 },
      { "name": "約書亞樹國家公園", "id": 1012 },
      { "name": "奧林匹克國家公園", "id": 1013 },
      { "name": "布萊斯峽谷國家公園", "id": 1014 },
      { "name": "瑞尼爾山國家公園", "id": 1015 },
      { "name": "仙納度國家公園", "id": 1016 },
      { "name": "夏威夷火山國家公園", "id": 1017 },
      { "name": "紅杉國家公園", "id": 1018 },
      { "name": "哈萊阿卡拉國家公園", "id": 1019 },
      { "name": "白沙國家公園", "id": 1020 },
      { "name": "火山口湖國家公園", "id": 1021 },
      { "name": "仙人掌國家公園", "id": 1022 },
      { "name": "大沙丘國家公園", "id": 1023 },
      { "name": "羚羊谷", "id": 1024 }
    ]
  },
  {
    name: '台灣',
    id: 1005,
    children: [
      { name: '台北', id: 27 },
      { name: '嘉義', id: 28 },
      { name: '嘉義梅山', id: 30 },
      { name: '南投', id: 29 },
    ]
  }
];

// export default [
//   { name: '洛杉磯' },
//   { name: '芝加哥' },
//   { name: '台北' },
//   { name: '棕櫚泉' },
//   { name: '猶他' },
//   { name: '匹茲堡' },
//   { name: '哥倫布' },
//   { name: '費城' },
//   { name: '華盛頓' },
//   { name: '多倫多' },
//   { name: '尼加拉瓜瀑布' },
//   { name: '夏威夷' },
//   { name: '辛辛那提' },
//   { name: '科羅拉多' },
//   { name: '拉斯維加斯' },
//   { name: '聖荷西' },
//   { name: '西雅圖' },
//   { name: '舊金山' },
// ];



// export default [
//   { name: '芝加哥' },
//   { name: '科羅拉多' },
//   { name: '洛杉磯' },
//   { name: '拉斯維加斯' },
//   { name: '匹茲堡' },
//   { name: '聖荷西' },
//   { name: '西雅圖' },
//   { name: '哥倫布' },
//   { name: '紐約' },
//   { name: '舊金山' },
//   { name: '克里夫蘭' },
//   { name: '費城' },
//   { name: '華盛頓' },
//   { name: '多倫多' },
//   { name: '尼加拉瓜瀑布' },
//   { name: '夏威夷' },
//   { name: '底特律' },
//   { name: '威斯康星' },
//   { name: '辛辛那提' },
//   { name: '舊金山' },
// ];


// export default [
//   { name: '芝加哥' },
//   { name: '科羅拉多' },
//   { name: '洛杉磯' },
//   { name: '拉斯維加斯' },
//   { name: '邁阿密' },
//   { name: '匹茲堡' },
//   { name: '聖荷西' },
//   { name: '西雅圖' },
//   { name: '休士頓' },
//   { name: '哥倫布' },
//   { name: '紐約' },
//   { name: '達拉斯' },
//   { name: '奧蘭多' },
//   { name: '舊金山' },
//   { name: '猶他' },
//   { name: '克里夫蘭' },
//   { name: '鹽湖城' },
//   { name: '佛羅里達' },
// ]



// const cityMappings = {
//   "洛杉磯": "LA",
//   "芝加哥": "chicago",
//   "科羅拉多": "colorado",
//   "拉斯維加斯": "las vegas",
//   "邁阿密": "Miami",
//   "匹茲堡": "pittsburgh",
//   "聖荷西": "san jose",
//   "西雅圖": "seattle",
//   "休士頓": "休士頓",
//   "哥倫布": "哥倫布",
//   "紐約": "紐約",
//   "達拉斯": "達拉斯",
//   "奧蘭多": "奧蘭多",
//   "舊金山": "san francisco",
//   "猶他": "猶他",
//   "克里夫蘭": "克里夫蘭",
//   "鹽湖城": "鹽湖城",
//   "佛羅里達": "佛羅里達",
//   // Add more city mappings as needed
// };
// 
// 

// export default [
//   { name: '芝加哥' },
//   { name: '科羅拉多' },
//   { name: '洛杉磯' },
//   { name: '拉斯維加斯' },
//   { name: '邁阿密' },
//   { name: '匹茲堡' },
//   { name: '聖荷西' },
//   { name: '西雅圖' },
//   { name: '休士頓' },
//   { name: '哥倫布' },
//   { name: '紐約' },
//   { name: '達拉斯' },
//   { name: '奧蘭多' },
//   { name: '舊金山' },
//   { name: '猶他' },
//   { name: '克里夫蘭' },
//   { name: '鹽湖城' },
//   { name: '佛羅里達' },
//   { name: '費城' },
//   { name: '華盛頓' },
//   { name: '多倫多' },
//   { name: '尼加拉瓜瀑布' },
//   { name: '夏威夷' },
//   { name: '底特律' },
//   { name: '威斯康星' },
//   { name: '密歇根' },
//   { name: '辛辛那提' },
//   { name: '舊金山' },
// ];


